/*Завдання 4.1

π - число “пі”. Ви можете використати Math.PI у вашому дз для вираження цього числа

Створіть змінну radius і присвойте їй числове значення радіуса кола.
Обчисліть площу кола за формулою π * radius^2 і виведіть результат.*/

let radius = 23;

const circleArea = Math.PI * (radius ** 2);

console.log(circleArea)

/*Завдання 4.2

Створіть змінну length і присвойте їй числове значення довжини прямокутника.
Створіть змінну width і присвойте їй числове значення ширини прямокутника.
Обчисліть площу прямокутника за формулою length * width і виведіть результат.*/

let length = 23.15;
let width = 34.45;

console.log((length * width).toFixed(1))

/*Завдання 4.3

Створіть змінну radius і присвойте їй числове значення радіуса циліндра.
Створіть змінну height і присвойте їй числове значення висоти циліндра.
Обчисліть об'єм циліндра за формулою π * radius^2 * height і виведіть результат.
Округліть кожне отримане значення до 2 значень після крапки */

let radiusCylinder = 15.245;
let heightCylinder = 43.215;

console.log ((Math.PI * Math.pow(radiusCylinder,2) * heightCylinder).toFixed(2))