/*Завдання 2: Конкатенація радків та шаблонний рядок

Створіть дві змінні, які містять імена двох осіб. 
Використовуючи конкатенацію рядків, створіть новий рядок, який містить вітання для обох осіб. 
Виведіть результат в консоль. 
Потім використайте шаблонний рядок для створення того ж вітання. 
Виведіть результат в консоль. */

let name1 = "Nastya";
let name2 = "Masha";

const greeting = "Hello " + name1 + " and " + name2
console.log(greeting)

const templateGreeting = `Hello ${name1} and ${name2}`;
console.log(templateGreeting);
